<!-- dflook/terraform-github-actions {"workspace":"multiple_vars-2","backend_type":"remote","backend":"f2e4920856834784f457286bdee5c642c36ed9f246e5a59660d7a12b4a04767e","plan_job_ref":"Job Test Terraform cloud #365 at https://github.com/dflook/terraform-github-actions/actions/runs/20957882873","plan_hash":"83cf42d9d64a518641951fae5638850f29f47636b6073476c28044c6439db1c1","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __multiple_vars-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #365](https://github.com/dflook/terraform-github-actions/actions/runs/20957882873)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>